
<details><summary>Terraform Plan</summary>

```text

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_membership.member["39Hane"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "39Hane"
    }

  # github_membership.member["Art-Atlas"] will be updated in-place
  ~ resource "github_membership" "member" {
        id       = "ictsc:Art-Atlas"
      ~ role     = "member" -> "admin"
        # (2 unchanged attributes hidden)
    }

  # github_membership.member["Dodai-Dodai"] will be updated in-place
  ~ resource "github_membership" "member" {
        id       = "ictsc:Dodai-Dodai"
      ~ role     = "member" -> "admin"
        # (2 unchanged attributes hidden)
    }

  # github_membership.member["Fuuma0000"] will be updated in-place
  ~ resource "github_membership" "member" {
        id       = "ictsc:Fuuma0000"
      ~ role     = "member" -> "admin"
        # (2 unchanged attributes hidden)
    }

  # github_membership.member["Nishinoyama"] will be destroyed
  # (because key ["Nishinoyama"] is not in for_each map)
  - resource "github_membership" "member" {
      - etag     = "W/\"ef542f2619c089a9e6240cc26f7073c11829e4b5ccf4573a396fcd8626032893\"" -> null
      - id       = "ictsc:Nishinoyama" -> null
      - role     = "admin" -> null
      - username = "Nishinoyama" -> null
    }

  # github_membership.member["SouJimmy"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "SouJimmy"
    }

  # github_membership.member["bqc0n"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "bqc0n"
    }

  # github_membership.member["ishisora"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "ishisora"
    }

  # github_membership.member["k-84mo10"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "k-84mo10"
    }

  # github_membership.member["nagayon-935"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "nagayon-935"
    }

  # github_membership.member["nishinoyama"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "nishinoyama"
    }

  # github_membership.member["oshamashama"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "oshamashama"
    }

  # github_membership.member["private-yusuke"] will be updated in-place
  ~ resource "github_membership" "member" {
        id       = "ictsc:private-yusuke"
      ~ role     = "member" -> "admin"
        # (2 unchanged attributes hidden)
    }

  # github_membership.member["red-3ya"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "red-3ya"
    }

  # github_membership.member["rk76feWF"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "rk76feWF"
    }

  # github_membership.member["takonomura"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "takonomura"
    }

  # github_membership.member["toma1128"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "toma1128"
    }

  # github_membership.member["tosuke"] will be updated in-place
  ~ resource "github_membership" "member" {
        id       = "ictsc:tosuke"
      ~ role     = "member" -> "admin"
        # (2 unchanged attributes hidden)
    }

  # github_team.team["ictsc2025"] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "member of ictsc2025"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "ictsc2025"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_members.team_member["Admins"] will be updated in-place
  ~ resource "github_team_members" "team_member" {
        id      = "2008807"
        # (2 unchanged attributes hidden)

      + members {
          + role     = "maintainer"
          + username = "Art-Atlas"
        }
      + members {
          + role     = "maintainer"
          + username = "Dodai-Dodai"
        }
      + members {
          + role     = "maintainer"
          + username = "Fuuma0000"
        }
      + members {
          + role     = "maintainer"
          + username = "private-yusuke"
        }
      + members {
          + role     = "maintainer"
          + username = "tosuke"
        }
      - members {
          - role     = "member" -> null
          - username = "tosuke" -> null
        }

        # (18 unchanged blocks hidden)
    }

  # github_team_members.team_member["ictsc2023"] will be updated in-place
  ~ resource "github_team_members" "team_member" {
        id      = "8186988"
        # (2 unchanged attributes hidden)

      + members {
          + role     = "maintainer"
          + username = "Art-Atlas"
        }
      + members {
          + role     = "maintainer"
          + username = "Fuuma0000"
        }
      - members {
          - role     = "member" -> null
          - username = "Art-Atlas" -> null
        }
      - members {
          - role     = "member" -> null
          - username = "Fuuma0000" -> null
        }

        # (10 unchanged blocks hidden)
    }

  # github_team_members.team_member["ictsc2024"] will be updated in-place
  ~ resource "github_team_members" "team_member" {
        id      = "10324448"
        # (2 unchanged attributes hidden)

      + members {
          + role     = "maintainer"
          + username = "Art-Atlas"
        }
      + members {
          + role     = "maintainer"
          + username = "Dodai-Dodai"
        }
      + members {
          + role     = "maintainer"
          + username = "Fuuma0000"
        }
      + members {
          + role     = "maintainer"
          + username = "private-yusuke"
        }
      - members {
          - role     = "maintainer" -> null
          - username = "takehaya" -> null
        }
      + members {
          + role     = "maintainer"
          + username = "tosuke"
        }
      - members {
          - role     = "member" -> null
          - username = "Art-Atlas" -> null
        }
      - members {
          - role     = "member" -> null
          - username = "Dodai-Dodai" -> null
        }
      - members {
          - role     = "member" -> null
          - username = "Fuuma0000" -> null
        }
      - members {
          - role     = "member" -> null
          - username = "private-yusuke" -> null
        }
      - members {
          - role     = "member" -> null
          - username = "tosuke" -> null
        }

        # (23 unchanged blocks hidden)
    }

  # github_team_members.team_member["ictsc2025"] will be created
  + resource "github_team_members" "team_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "Art-Atlas"
        }
      + members {
          + role     = "maintainer"
          + username = "Crow314"
        }
      + members {
          + role     = "maintainer"
          + username = "Dodai-Dodai"
        }
      + members {
          + role     = "maintainer"
          + username = "Fuuma0000"
        }
      + members {
          + role     = "maintainer"
          + username = "logica0419"
        }
      + members {
          + role     = "maintainer"
          + username = "nishinoyama"
        }
      + members {
          + role     = "maintainer"
          + username = "private-yusuke"
        }
      + members {
          + role     = "maintainer"
          + username = "tosuke"
        }
      + members {
          + role     = "member"
          + username = "210on"
        }
      + members {
          + role     = "member"
          + username = "39Hane"
        }
      + members {
          + role     = "member"
          + username = "SouJimmy"
        }
      + members {
          + role     = "member"
          + username = "bqc0n"
        }
      + members {
          + role     = "member"
          + username = "hitto-hub"
        }
      + members {
          + role     = "member"
          + username = "ishisora"
        }
      + members {
          + role     = "member"
          + username = "k-84mo10"
        }
      + members {
          + role     = "member"
          + username = "nagayon-935"
        }
      + members {
          + role     = "member"
          + username = "oshamashama"
        }
      + members {
          + role     = "member"
          + username = "red-3ya"
        }
      + members {
          + role     = "member"
          + username = "rk76feWF"
        }
      + members {
          + role     = "member"
          + username = "syuuya-nakatomi"
        }
      + members {
          + role     = "member"
          + username = "takonomura"
        }
      + members {
          + role     = "member"
          + username = "toma1128"
        }
    }

Plan: 14 to add, 8 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>